5-nayya-shopping-cart/app/models/user.rb

  def create_cart
    Cart.create(user: self)
---
INSERT INTO "carts" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?) RETURNING "id"  [["created_at", "2024-02-14 21:13:10.546837"], ["updated_at", "2024-02-14 21:13:10.546837"], ["user_id", 2]]