5-nayya-shopping-cart/app/controllers/carts_controller.rb

  def show
    @cart = current_user.cart
    @line_items = @cart.line_items
    @products = Product.all
---
SELECT "products".* FROM "products"

  def add_item
    @cart = current_user.cart
    @product = Product.find(params[:product_id])
    @line_item = LineItem.new(cart: @cart, product: @product, quantity: 1)

    if @line_item.save
      @product.update(inventory: @product.inventory - 1)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "line_items" ("cart_id", "product_id", "quantity", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["cart_id", 2], ["product_id", 1], ["quantity", 1], ["price", nil], ["created_at", "2024-02-15 22:04:40.090312"], ["updated_at", "2024-02-15 22:04:40.090312"]]
UPDATE "products" SET "inventory" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["inventory", 9], ["updated_at", "2024-02-15 22:04:40.092372"], ["id", 1]]

  def remove_item
    @line_item = LineItem.find(params[:id])
    @product = @line_item.product
    if @line_item.destroy
      @product.update(inventory: @product.inventory + 1)
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT ?  [["id", 39], ["LIMIT", 1]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 39]]
UPDATE "products" SET "inventory" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["inventory", 6], ["updated_at", "2024-02-15 22:05:01.977329"], ["id", 1]]