5-nayya-shopping-cart/app/views/carts/show.html.erb


<% if @cart.line_items.empty? %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 1]]
SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT ?  [["cart_id", 1], ["LIMIT", 1]]

<% else %>
    <p>You have <%= pluralize(@cart.line_items.size, "item") %> in your cart.</p>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 1]]
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 1]]